em++ -O3 --closure 1 -lembind -o immolate.js include/immolate.cpp -s EXPORT_NAME="'Immolate'"

1：☠️ | 💠灵魂 | ➕黑龟豆#33、🧱斗牛🔘#36、🧱照片#52、5️⃣黄昏#67、🥤可乐#92、👑男爵#94
2：👝🧬DNA、👥头脑 | 👥蓝图#5、✖️杂技#18、💰卫星#22、💰门票#23、5️⃣黄昏#49、➕窃贼#65、💰车位#78、🧱选票#90、✖️老千#100
3：💰交易卡#13、👥头脑#14、🥤可乐#17、🧱选票#27、5️⃣偶像#64、🧱照片#72、💰车位#76
4：👝🧱选票 | 🧱选票#23、👥头脑#31、👥隐形#54、💿第六感#74、➕窃贼#86
5：5️⃣偶像#6、🪙证书#13、🧱选票#19、👑男爵#25、5️⃣喜与悲#31、💿通灵#32、👑哑剧#37、✖️杂技#69、💰车位#74、5️⃣黄昏#75
6：✖️老千#9、👑哑剧#11、➕黑龟豆#20、🧱照片#37、💰车位#44、💿通灵#71
7：💠神秘生物 | 👝💰9霄 | 🧬DNA#2、👑哑剧#8、5️⃣喜与悲#9、🧱选票#25、5️⃣黄昏#27、✖️老千#34、💰卫星#47、🧱斗牛#49、💿第六感#57、💰9霄#62、💰门票#70、➕窃贼#93
8：☠️ | ✖️杂技#24、💿第六感#53、💰车位#88
9：💠神秘生物 | 5️⃣偶像#13、💰车位#20、5️⃣喜与悲#21、💿通灵#47、💰卫星#50、✖️杂技#59、💰9霄#66、👑哑剧#84、🧱斗牛#99
10：➕窃贼#21、💿第六感#36、💰车位#38、🪙证书#41、🧱选票#45、💰9霄#47、👥头脑#78
11：☠️ | 💠神秘生物 | 5️⃣黄昏#13、🧱选票#16、🧬DNA#27、➕黑龟豆#34、💿第六感#36、✖️老千#43、👥蓝图#47、🧱照片#55、💰车位#58、💰月球#72、💰门票#91、💰卫星#95、➕窃贼#96
12：♔红封K | 🧱照片#31、5️⃣偶像#32、💿通灵#53、🪙证书#68、👥隐形#73、👑哑剧#81、💰车位#86、✖️老千#91、💰9霄#95、💰门票#98
13：👝🪙证书 | 💰车位#2、🎪马戏团#5、💰9霄#14、💰门票#24、👑男爵#35、💰卫星#45、✖️杂技#65、💰交易卡#92
14：👝➕窃贼 | 💰卫星#6、🧱选票#11、💰9霄#22、✖️杂技#67、🪙证书#73、👥头脑#81、💰月球#84、💰车位#97
15：🧱斗牛#4、➕窃贼#5、🎪马戏团#8、5️⃣喜与悲#24、🧱照片#31、🧱选票#48、🥤可乐#55、💿第六感#65、💰门票#75、👑哑剧#80、💰交易卡#91、➕黑龟豆#99
16：💰门票#20、💰车位#28、🥤可乐#34、💰交易卡#50
17：🧱选票#14、💿第六感#23、💰车位#30、👥蓝图#41、➕黑龟豆#45、5️⃣偶像#60、🧬DNA#73
18：💰门票#2、💿通灵#20、🧱选票#21、🧱斗牛#22、5️⃣黄昏#24、✖️杂技#47
19：♔黄金K | 💰9霄#4、🧱照片#6、💰车位#16、💰卫星#19、👑哑剧#27、💰交易卡#34、💿通灵#49、🧱选票#90
20：🔘 | 🧬DNA#26、💰车位#41、🥤可乐#43、💰交易卡#55、🧱斗牛#62、5️⃣黄昏#63、💰门票#64、👑哑剧#67、💰卫星#68
21：☠️ | 👝💿通灵 | 💿通灵#1、✖️老千#11、🪙证书#14、🧱选票#21、💰卫星#25、💰交易卡#27、💰车位#45、5️⃣喜与悲#46、👑男爵#95
22：💰门票#4、🧬DNA#7、🧱选票#10、👑哑剧#12、💿通灵#36、💰车位#47、🎪马戏团#87
23：🧱照片#3、🎪马戏团#30、🧱选票#44、🧱斗牛#45、🧬DNA#54、💰门票#90
24：🥤可乐#2、💰9霄#9、💰车位#16、✖️老千#23、🧱斗牛#38、💰月球#61、🧱选票#93、💰门票#96
25：☠️ | 💠灵魂 | ♔红封K | 💰车位#8、5️⃣喜与悲#17、🎪马戏团#27、🧱斗牛#38、💰门票#68、🧱照片#75、💰9霄#76、💿第六感#81、👑哑剧#94
26：☠️ | 🧱照片#9、💿第六感#13、💰门票#32、✖️杂技#50、🧱选票#62、👑男爵#75、5️⃣喜与悲#94
27：👝💰交易卡 | 🥤可乐#5、💰9霄#11、💰门票#14、💰卫星#18、👑男爵#21、💰车位#30、✖️杂技#83、➕窃贼#92、🧱选票#94、👑哑剧#98
28：🖇️ | 💰交易卡#5、💰门票#9、💰车位#30、🧱选票#44、➕黑龟豆#60、💰9霄#89、👑哑剧#96
29：☠️ | 💰门票#2、🎪马戏团#3、🧱照片#19、👥头脑#26、💰交易卡#35、✖️杂技#87
30：👝🥤可乐 | 💰月球#5、🧱选票#8、➕黑龟豆#15、🧱斗牛#30、🥤可乐#37、🧱照片#43、🎪马戏团#49
31：💿通灵#9、🧱选票#27、✖️杂技#44、5️⃣黄昏#61、💰门票#75、5️⃣偶像#81、💰车位#96
32：☠️ | 🔘 | 🧱照片#10、👑哑剧#15、🧬DNA#21、💰门票#47、👥隐形#51、💰车位#86
33：💰车位#3、💰门票#13、💰月球#27、✖️老千#34、💰交易卡#37、👑哑剧#50、🧱选票#63、🧱照片#93、💰9霄#98
34：💿通灵#15、🧱照片#40、🥤可乐#51、💰9霄#71、👑男爵#72
35：☠️ | 👝👥隐形 | 💰车位#26、🧱斗牛#35、5️⃣喜与悲#68、💰门票#77、👑哑剧#93
36：☠️ | 🎟️ | 💠灵质(负片) | 💰交易卡#2、💰门票#3、🥤可乐#16、🧱选票#25、👥蓝图#27、💰月球#29、💿第六感#37、➕黑龟豆#63、👥隐形#64、5️⃣喜与悲#65、🪙证书#70、💰车位#72、🎪马戏团#73、💰9霄#98
37：👑哑剧#9、💿通灵#10、🪙证书#18、5️⃣喜与悲#19、💰车位#23、🧱选票#40、🧱照片#41、🧱斗牛#66、✖️杂技#85、🥤可乐#95
38：☠️ | 💰卫星#7、💰车位#41、🧱照片#49、👑男爵#66、➕黑龟豆#75、💰门票#90
39：🖇️ | 5️⃣喜与悲#2、👥头脑#14、🧬DNA#20、✖️老千#66、🧱照片#74、💰车位#79、🪙证书#80、👑哑剧#99